app/controllers/employees_controller.rb

  def index
    @employees = Employee.all
---
SELECT "employees".* FROM "employees"

  def create
      @employee = Employee.new(employee_params)

      if @employee.save
---
INSERT INTO "employees" ("name", "age", "gender", "designation", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Pradeepa"], ["age", 22], ["gender", "Female"], ["designation", "Software developer"], ["created_at", "2023-03-18 17:01:39.254020"], ["updated_at", "2023-03-18 17:01:39.254020"]]

  def update
    if @employee.update(employee_params)
---
UPDATE "employees" SET "name" = ?, "age" = ?, "gender" = ?, "designation" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["name", "Ram"], ["age", 21], ["gender", "Male"], ["designation", "Data Analyst"], ["updated_at", "2023-03-19 08:24:07.458170"], ["id", 16]]

  def destroy
    @employee.destroy
---
DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 1]]

    def find_employees
      @employee = Employee.find_by(id: params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]